init.org
#+TITLE: Config of Emacs
#+DESCRIPTION: This is the org mode version of my config of emacs
#+FILETAGS: Config
#+PROPERTY: header-args :tangle ~/.config/emacs/init.el

* Table of Content :toc:noexport:
- [[#customized-default][Customized Default]]
- [[#package-initialize][Package initialize]]
- [[#packages][Packages]]
  - [[#keybindings][Keybindings]]
  - [[#generally-helpful-package][Generally helpful Package]]
  - [[#ui][UI]]
  - [[#completion][Completion]]
  - [[#coding][Coding]]
  - [[#org][Org]]
- [[#custom-function][Custom Function]]
- [[#keybindings-1][Keybindings]]
  - [[#magit-map][Magit Map]]
  - [[#buffer-map][Buffer Map]]
  - [[#file-map][File Map]]
  - [[#org-map][Org Map]]
  - [[#lsp-map][Lsp Map]]

* Customized Default
#+begin_src emacs-lisp
;;; init.el -*- lexical-binding: t; -*-
(setenv "LSP_USE_PLISTS" "1")
(setq create-lockfiles nil)
(setq recentf-max-menu-items 25)
(recentf-mode 1)
(setq gc-cons-threshold 100000000)
(setq read-process-output-max (* 1024 1024))
(set-default-coding-systems 'utf-8)
(setq inhibit-startup-message t)
(setq make-backup-files nil)
(setq visible-bell t)
(setq-default tab-width 4)
(setq-default evil-shift-width tab-width)
(setq-default indent-tabs-mode nil)
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative
      scroll-margin 30)
(setq electric-pair-preserve-balance nil)
(setq dired-recursive-copies 'always)
(setq dired-recursive-deletes 'always)
(setq delete-by-moving-to-trash t)
(setq dired-listing-switches
      "-AGFhlv --group-directories-first --time-style=long-iso")
(setq dired-dwim-target t)
(setq dired-auto-revert-buffer #'dired-directory-changed-p) ; also see `dired-do-revert-buffer'
(setq dired-make-directory-clickable t) ; Emacs 29.1
(setq dired-free-space nil) ; Emacs 29.1

(add-hook 'dired-mode-hook #'hl-line-mode)
(setq dired-isearch-filenames 'dwim)
(setq dired-create-destination-dirs 'ask)
(setq dired-vc-rename-file t)
(setq dired-do-revert-buffer (lambda (dir) (not (file-remote-p dir))))

(setq dired-clean-up-buffers-too t)
(setq dired-clean-confirm-killing-deleted-buffers t)
(setq dired-x-hands-off-my-keys t)    ; easier to show the keys I use
(setq dired-bind-man nil)
(setq dired-bind-info nil)
(setq delete-by-moving-to-trash t
      +vertico-consult-fd-args "fd -p --color=never -i --type f -E node_modules --regex")
(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)
(tooltip-mode -1)
(electric-pair-mode 1)
(set-fringe-mode 10)
(set-face-attribute 'default nil :font "JetBrains Mono" :height 100)
(setq auto-save-default t
            truncate-string-ellipsis "<>"
            which-key-idle-delay 0.5
            evil-snipe-scope 'whole-visible)
(put 'narrow-to-region 'disabled nil)
(setq x-stretch-cursor t
            window-combination-resize t
            global-auto-revert-mode 1
            global-auto-revert-non-file-buffers t)
#+end_src
* Package initialize
#+begin_src emacs-lisp
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
 (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
   (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

* Packages
** Keybindings
*** Evil
#+begin_src emacs-lisp
  (eval-when-compile (setq evil-want-keybinding nil))

  (use-package evil
    :init
    (progn
        (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
        (setq evil-want-keybinding nil)
        (setq evil-undo-system 'undo-fu))
    :config
    (progn
    (evil-mode 1))
        (setq evil-move-cursor-back nil
            evil-want-fine-undo t
            evil-move-beyond-eol t
            evil-vsplit-window-right t
            evil-split-window-below t))
#+end_src
*** General
#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup t))
#+end_src
*** Evil Collection
#+begin_src emacs-lisp
(use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src
** Generally helpful Package
*** Emms
#+begin_src emacs-lisp
(use-package emms
  :init
    (require 'emms-setup)
    (emms-all)
    (setq emms-source-file-default-directory "~/Music/"
	  emms-info-functions '(emms-info-native)
	  emms-player-list '(emms-player-vlc)
	  emms-repeat-track t
	  emms-mode-line-mode t
	  emms-playlist-buffer-name "*Music*"
	  emms-playing-time-mode t
	  emms-info-asynchronously t
	  emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find)
    (emms-add-directory-tree "~/Music/")
    (emms-add-directory-tree "~/Videos/Test Video"))
#+end_src
*** Helpful
#+begin_src emacs-lisp
(use-package helpful
  :ensure t
    :config
        (global-set-key (kbd "C-h f") #'helpful-callable)
        (global-set-key (kbd "C-h v") #'helpful-variable)
        (global-set-key (kbd "C-h k") #'helpful-key)
        (global-set-key (kbd "C-c C-d") #'helpful-at-point)
        (global-set-key (kbd "C-h F") #'helpful-function)
        (global-set-key (kbd "C-h C") #'helpful-command))
#+end_src
*** Undo fu
#+begin_src emacs-lisp
(use-package undo-fu)
#+end_src
*** Undohist
#+begin_src emacs-lisp
(use-package undohist
  :config
    (undohist-initialize))
#+end_src
*** Savehist
#+begin_src emacs-lisp
(use-package savehist
  :init
  (savehist-mode))
#+end_src
** UI
*** Which Key
#+begin_src emacs-lisp
(use-package which-key 
  :init
  (which-key-mode))
#+end_src
*** Doom theme
#+begin_src emacs-lisp
(use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
            doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-dracula t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config)
    (custom-set-faces
        '(doom-themes-visual-bell (( t(:background "#00FFFF"))))
        '(emms-playlist-selected-face (( t(:foreground "royal blue"))))
        '(emms-playlist-track-face (( t(:foreground "#5da3e7"))))
        '(emms-playlist-selected-face (( t(:foreground "royal blue"))))
        '(emms-playlist-track-face (( t(:foreground "#5da3e7"))))
        '(org-ellipsis (( t(:foreground "#C678DD"))))))
#+end_src
*** Modus theme
#+begin_src emacs-lisp
;; (use-package modus-themes
;;    :config
;;    (setq modus-themes-italic-constructs t
;;          modus-themes-bold-constructs nil)
;;    (load-theme 'modus-vivendi t))
#+end_src
*** Doom modeline
#+begin_src emacs-lisp
(use-package doom-modeline
  :init (doom-modeline-mode 1))
#+end_src
*** All Icons Mode Line
#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src
*** Completions Icons
#+begin_src emacs-lisp
(use-package all-the-icons-completion
      :config
      (all-the-icons-completion-mode)
      (add-hook 'marginalia-mode-hook #'all-the-icons-completion-marginalia-setup))
#+end_src
*** Dired Icons
#+begin_src emacs-lisp
(use-package all-the-icons-dired
  :config
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
#+end_src
*** Unicode fonts
#+begin_src emacs-lisp
(use-package unicode-fonts)
#+end_src
*** Emojify
#+begin_src emacs-lisp
(use-package emojify)
#+end_src
** Completion
*** Corfu
#+begin_src emacs-lisp
(use-package corfu
  :init
  (global-corfu-mode)
  ;; Setup corfu for popup like completion
  (setq corfu-cycle t  ; Allows cycling through candidates
        corfu-auto t   ; Enable auto completion
        corfu-auto-prefix 0  ; Complete with less prefix keys
        corfu-auto-delay 0.0  ; No delay for completion
        corfu-echo-documentation 0.25  ; Echo docs for current completion option
        corfu-quit-at-boundary 'insert
        )
  (global-corfu-mode 1)
  (advice-add #'lsp-completion-at-point :around #'cape-wrap-noninterruptible)
  (corfu-popupinfo-mode 1))
#+end_src
