init.org
*** Embark Consult
#+begin_src emacs-lisp
(use-package embark-consult
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))
#+end_src
** Coding
*** Evil Nerd Commentor
#+begin_src emacs-lisp
(use-package evil-nerd-commenter)
#+end_src
*** Lsp Mode
#+begin_src emacs-lisp
  (use-package lsp-mode
    :ensure t
    :custom
    (lsp-completion-provider :none) ;; we use Corfu!
    :init
    (setq lsp-log-io nil)
    (defun my/lsp-mode-setup-completion ()
      (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
            '(flex))) ;; Configure flex
    :hook
    (lsp-completion-mode . my/lsp-mode-setup-completion))
#+end_src
*** Rust
**** Rustic
#+begin_src emacs-lisp
  (use-package rustic
  :ensure t
    :config
      (setq 
          lsp-rust-analyzer-display-chaining-hints t
          lsp-rust-analyzer-expand-macro t
          lsp-rust-analyzer-display-parameter-hints t
          lsp-rust-analyzer-server-display-inlay-hints t))
#+end_src
*** Typescript
**** Web mode
#+begin_src emacs-lisp
(setq web-mode-markup-indent-offset 2)
(setq web-mode-code-indent-offset 2)
(setq web-mode-css-indent-offset 2)
(use-package web-mode
  :ensure t
  :mode (("\\.js\\'" . web-mode)
	 ("\\.jsx\\'" .  web-mode)
	 ("\\.tsx\\'" .  web-mode)
	 ("\\.ts\\'" . web-mode)
	 ("\\.tsx\\'" . web-mode)
	 ("\\.html\\'" . web-mode))
  :commands web-mode)
#+end_src
**** Flycheck
#+begin_src emacs-lisp
(use-package flycheck)
#+end_src
**** Tide
#+begin_src emacs-lisp
    (defun setup-tide-mode ()
      (interactive)
      (tide-setup)
      (flycheck-mode +1)
      (setq flycheck-check-syntax-automatically '(save mode-enabled))
      (eldoc-mode +1)
      (tide-hl-identifier-mode +1))

(add-hook 'tsx-ts-mode-hook #'setup-tide-mode)
;; if you use treesitter based typescript-ts-mode (emacs 29+)
(use-package tide
  :ensure t
  :after (flycheck)
  :hook ((typescript-ts-mode . tide-setup)
         (tsx-ts-mode . tide-setup)
         (typescript-ts-mode . tide-hl-identifier-mode)
         (before-save . tide-format-before-save)))
#+end_src
*** Lsp ui
#+begin_src emacs-lisp
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-peek-enable t
          lsp-ui-doc-position 'bottom
          lsp-ui-peek-always-show t
          lsp-signature-auto-activate t
          lsp-ui-doc-delay 0.0
          lsp-ui-sideline-show-diagnostics t 
          lsp-enable-symbol-highlighting t 
          lsp-ui-doc-enable t 
          lsp-ui-doc-show-with-cursor t 
          lsp-ui-doc-show-with-mouse t 
          lsp-lens-enable t 
          lsp-headerline-breadcrumb-enable t 
          lsp-ui-sideline-show-diagnostics t 
          lsp-modeline-code-actions-enable t 
          lsp-eldoc-enable-hover t 
          lsp-completion-show-detail t 
          lsp-completion-show-kind t 
          lsp-ui-sideline-ignore-duplicate t
          lsp-ui-sideline-actions-icon lsp-ui-sideline-actions-icon-default))
#+end_src
*** Tree sitter
#+begin_src emacs-lisp
(use-package tree-sitter)
(use-package tree-sitter-langs)
#+end_src
*** Yasnippet
#+begin_src emacs-lisp
(use-package yasnippet
  :ensure t
  :config
  (setq yas-snippet-dirs
      '("~/.config/emacs/snippets"))

(yas-global-mode 1) ;; or M-x yas-reload-all if you've started YASnippet already.
#+end_src
*** Magit
#+begin_src emacs-lisp
(use-package magit)
#+end_src
*** Git gutter
#+begin_src emacs-lisp
(use-package git-gutter-fringe
    :config
    (global-git-gutter-mode +1)
    (setq-default fringes-outside-margins t)
        ;; thin fringe bitmaps
        (define-fringe-bitmap 'git-gutter-fr:added [224]
        nil nil '(center repeated))
        (define-fringe-bitmap 'git-gutter-fr:modified [224]
        nil nil '(center repeated))
        (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240]
        nil nil 'bottom))
#+end_src
*** Smart compile
#+begin_src emacs-lisp
(use-package smart-compile
  :config
  (setq smart-compile-check-build-system 'nil)
  (add-to-list 'smart-compile-alist '("\\.[Cc]+[Pp]*\\'" . "make %n && touch inputf.in && timeout 4s ./%n < inputf.in &> outputf.in "))
  (add-to-list 'smart-compile-alist  '("\\.rs$" . "touch inputf.in && cargo run -q < inputf.in &> outputf.in "))))
#+end_src
*** Evil Multi Edit
#+begin_src emacs-lisp
(use-package evil-multiedit
    :config
    (evil-multiedit-default-keybinds))
#+end_src
*** Projectile
#+begin_src emacs-lisp
(use-package projectile
  :init
  (projectile-mode +1)
  :bind (:map projectile-mode-map
              ("s-p" . projectile-command-map)
              ("C-c p" . projectile-command-map)))
#+end_src
*** Rainbow Delimiter
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
** Org
*** Defaults
#+begin_src emacs-lisp
(defun adi/org-setup()
    (org-indent-mode 1)
    (org-toggle-pretty-entities 1))
(add-hook 'org-mode-hook 'adi/org-setup)
#+end_src
*** Evil org
#+begin_src emacs-lisp
(use-package evil-org)
#+end_src
*** Org cliplink
#+begin_src emacs-lisp
(use-package org-cliplink)
#+end_src
*** Link hint
#+begin_src emacs-lisp
(use-package link-hint)
#+end_src
*** Org toc
#+begin_src emacs-lisp
(use-package toc-org)  
(add-hook 'org-mode-hook (lambda () (toc-org-mode 1)))
#+end_src
*** Org Superstar
#+begin_src emacs-lisp
(use-package org-superstar)
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
#+end_src
*** Org appear
#+begin_src emacs-lisp
(use-package org-appear)
(add-hook 'org-mode-hook 'org-appear-mode)
#+end_src
*** Org tempo
#+begin_src emacs-lisp
(setq org-todo-keywords
    '((sequence "TODO(t)" "PROJ(p)" "ACTIVE(a)" "REVIEW(r)" "START(s)" "NEXT(n)" "WORKING(w)" "HOLD(h)" "|" "DONE(d)" "KILL(k)")
        (sequence "|" "OKAY(o)" "YES(y)" "NO(n)")))

(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("la" . "src latex"))
(add-to-list 'org-structure-template-alist '("ec" . "src emacs-lisp"))
#+end_src
*** Org Denote
#+begin_src emacs-lisp
(use-package denote
    :config
    (setq denote-directory "~/Documents/Denote")
    (setq  denote-known-keywords '()))
#+end_src

* Custom Function
*** Kitty Async
#+begin_src emacs-lisp
    (defun kitty-async-process ()
      (interactive)
      (start-process "kitty" nil "setsid" "kitty" "-d" default-directory))
  (define-key evil-normal-state-map "," 'kitty-async-process)

#+end_src
*** Brave Vscode docs
#+begin_src emacs-lisp
    (defun brave-vscode-docs ()
      (interactive)
      (start-process "brave" nil "setsid" "brave" "--incognito" "https://code.visualstudio.com/api/language-extensions/language-server-extension-guide"))

#+end_src
*** Competitive layout
#+begin_src emacs-lisp
    (defun Competitive-coding-output-input-toggle ()
      (interactive)
      (delete-other-windows)
      (kill-matching-buffers "*.in")
      (evil-window-vsplit)
      (other-window 1)
      (find-file (expand-file-name "inputf.in" default-directory))
      (evil-window-split)
      (other-window 1)
      (find-file (expand-file-name "outputf.in" default-directory))
      (other-window 1)
      (enlarge-window-horizontally 40))
  (evil-define-key 'normal c++-mode-map "C-c z" 'Competitive-coding-output-input-toggle)

#+end_src
*** Rust reset
#+begin_src emacs-lisp
    (defun rust-reset()
      (interactive)
      (widen)
      (erase-buffer)
      (insert "<cp")
      (yas-expand)
      (narrow-to-defun))

#+end_src
*** Rust paste input
#+begin_src emacs-lisp
    (defun code-input-refresh()
      (interactive)
      (write-region (current-kill 0) nil (concat default-directory "inputf.in") nil)
      (Competitive-coding-output-input-toggle))
  (evil-define-key 'normal c++-mode-map "C-c z" 'code-input-refresh)

#+end_src
*** Copy current file
#+begin_src emacs-lisp
    ;; source: http://steve.yegge.googlepages.com/my-dot-emacs-file
    (defun copy-current-file (new-name)
      "Copy current file to a NEW-NAME."
      (interactive (list
                    (read-string "New name: " (current-kill 0) nil (current-kill 0))))
      (let ((name (buffer-name))
            (filename (buffer-file-name)))
        (if (not filename)
            (message "Buffer '%s' is not visiting a file!" name)
          (if (get-buffer new-name)
              (message "A buffer named '%s' already exists!" new-name)
              (copy-file filename (concat (replace-regexp-in-string " " "" (capitalize (replace-regexp-in-string "[^[:word:]_]" " " new-name))) ".rs") 1)))))
#+end_src
