init.org
* Keybindings
#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (global-set-key (kbd "C-;") 'embark-act)
  (general-create-definer adi/leader-keys
   :states '(normal visual emacs jpnb)
   :keymaps 'override
   :prefix "SPC")
  (general-create-definer adi/leader-local-keys
   :states '(normal visual emacs jpnb)
   :keymaps 'override
   :prefix "SPC m")
  (adi/leader-keys
      "SPC" 'find-file
      "RET" 'denote-open-or-create)
  (general-define-key
      :states 'motion
      "K" 'helpful-at-point
      "M-/" 'evilnc-comment-or-uncomment-lines)
#+end_src
** Magit Map
#+begin_src emacs-lisp
(adi/leader-keys
    "gg" 'magit) 
#+end_src
** Buffer Map
#+begin_src emacs-lisp
(adi/leader-keys
    "bb" 'consult-buffer
    "bk" 'kill-this-buffer)
#+end_src
** File Map
#+begin_src emacs-lisp
(adi/leader-keys
    "fr" 'consult-recent-file)
#+end_src
** Org Map
#+begin_src emacs-lisp
(general-define-key
    :keymap 'org-mode-map
    :states 'normal
      "?\t" 'org-cycle
      "<RET>" 'org-open-at-point)
(adi/leader-local-keys org-mode-map
    "lc" 'org-cliplink)
#+end_src
** Lsp Map
#+begin_src emacs-lisp
  (general-define-key
      :keymap 'lsp-mode-map
      :states 'normal
        "K" 'lsp-describe-thing-at-point
        "C-c a" 'lsp-format-buffer)
#+end_src
*** Rustic Mode
#+begin_src emacs-lisp
  (adi/leader-local-keys
      :keymap 'rustic-mode-map
      "z" 'Competitive-coding-output-input-toggle
      "r" 'rust-reset
      "i" 'code-input-refresh
      "c" 'copy-current-file)
#+end_src
