init.el

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
(global-set-key (kbd "C-;") 'embark-act)
(general-create-definer adi/leader-keys
 :states '(normal visual emacs jpnb)
 :keymaps 'override
 :prefix "SPC")
(general-create-definer adi/leader-local-keys
 :states '(normal visual emacs jpnb)
 :keymaps 'override
 :prefix "SPC m")
(adi/leader-keys
    "SPC" 'find-file
    "RET" 'denote-open-or-create)
(general-define-key
    :states 'motion
    "K" 'helpful-at-point
    "M-/" 'evilnc-comment-or-uncomment-lines)

(adi/leader-keys
    "gg" 'magit)

(adi/leader-keys
    "bb" 'consult-buffer
    "bk" 'kill-this-buffer)

(adi/leader-keys
    "fr" 'consult-recent-file)

(general-define-key
    :keymap 'org-mode-map
    :states 'normal
      "?\t" 'org-cycle
      "<RET>" 'org-open-at-point)
(adi/leader-local-keys org-mode-map
    "lc" 'org-cliplink)

(general-define-key
    :keymap 'lsp-mode-map
    :states 'normal
      "K" 'lsp-describe-thing-at-point
      "C-c a" 'lsp-format-buffer)

(adi/leader-local-keys
    :keymap 'rustic-mode-map
    "z" 'Competitive-coding-output-input-toggle
    "r" 'rust-reset
    "i" 'code-input-refresh
    "c" 'copy-current-file)
